Revit 2025 API
YJustification Enumeration
 The justification of the framing element in Y.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 25.0.0.0 (25.0.0.0)
Syntax
public enum YJustification
Public Enumeration YJustification
public enum class YJustification
type YJustification
Members
Member name | Value | Description
Left | 0 |  Justification to the left of the element.
Center | 1 |  Justification to the geometrical center of the element.
Origin | 2 |  Justification to the origin of the element.
Right | 3 |  Justification to the right of the element.
See Also
Reference
Autodesk.Revit.DB.Structure Namespace